SrPatinhas/smarthalo-firmware/smart_halo-smarthaloe-stm-firmware-2d2a7e89e745/smarthaloE-stm-firmware.ioc
#MicroXplorer Configuration settings - do not modify
PD7.Mode=Simplex_Bidirectional_Master
PH0-OSC_IN.Locked=true
PD12.GPIO_Label=I2C_TP_SCL
PC7.GPIOParameters=GPIO_Label
PH0-OSC_IN.Signal=RCC_OSC_IN
VP_SYS_VS_tim6.Mode=TIM6
PE11.GPIOParameters=GPIO_Label
SPI1.VirtualType=VM_MASTER
PB10.Mode=RGB565
NVIC.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
PC12.Locked=true
TIM1.IPParameters=Channel-PWM Generation1 CH1
PC12.Signal=GPIO_Output
PB14.GPIO_Label=CAN_STBY
PA14.GPIO_Label=MCU_SWCLK
PC7.Locked=true
RCC.PLLFRACN=0
PD3.GPIOParameters=GPIO_Label
PC3_C.Mode=OCTOSPI1_IOL_Port1L
PD8.Locked=true
PC6.GPIO_Label=LCD_HSYNC
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
RCC.RTCFreq_Value=32768
PA3.GPIOParameters=GPIO_Label
PA6.GPIO_Label=VBAT_AN
PB6.GPIO_Label=I2C_LIGHT_SCL
PD4.Locked=true
PD0.Locked=true
RCC.CpuClockFreq_Value=280000000
PD2.GPIOParameters=GPIO_Label
PC5.Mode=RGB565
SH.S_TIM1_CH1.ConfNb=1
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
PE6.GPIO_Label=REV_ID_2
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.AHB4Freq_Value=280000000
RCC.SPI123CLockSelection=RCC_SPI123CLKSOURCE_PLL3
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.tgfx_display_interface=disp_ltdc
GFXMMU.Buf1Address=0x30070800
GFXMMU.GFXMMUtable=1/0/479,2/0/479,3/0/479,4/0/479,5/0/479,6/0/479,7/0/479,8/0/479,9/0/479,10/0/479,11/0/479,12/0/479,13/0/479,14/0/479,15/0/479,16/0/479,17/0/479,18/0/479,19/0/479,20/0/479,21/0/479,22/0/479,23/0/479,24/0/479,25/0/479,26/0/479,27/0/479,28/0/479,29/0/479,30/0/479,31/0/479,32/0/479,33/0/479,34/0/479,35/0/479,36/0/479,37/0/479,38/0/479,39/0/479,40/0/479,41/0/479,42/0/479,43/0/479,44/0/479,45/0/479,46/0/479,47/0/479,48/0/479,49/0/479,50/0/479,51/0/479,52/0/479,53/0/479,54/0/479,55/0/479,56/0/479,57/0/479,58/0/479,59/0/479,60/0/479,61/0/479,62/0/479,63/0/479,64/0/479,65/0/479,66/0/479,67/0/479,68/0/479,69/0/479,70/0/479,71/0/479,72/0/479,73/0/479,74/0/479,75/0/479,76/0/479,77/0/479,78/0/479,79/0/479,80/0/479,81/0/479,82/0/479,83/0/479,84/0/479,85/0/479,86/0/479,87/0/479,88/0/479,89/0/479,90/0/479,91/0/479,92/0/479,93/0/479,94/0/479,95/0/479,96/0/479,97/0/479,98/0/479,99/0/479,100/0/479,101/0/479,102/0/479,103/0/479,104/0/479,105/0/479,106/0/479,107/0/479,108/0/479,109/0/479,110/0/479,111/0/479,112/0/479,113/0/479,114/0/479,115/0/479,116/0/479,117/0/479,118/0/479,119/0/479,120/0/479,121/0/479,122/0/479,123/0/479,124/0/479,125/0/479,126/0/479,127/0/479,128/0/479,129/0/479,130/0/479,131/0/479,132/0/479,133/0/479,134/0/479,135/0/479,136/0/479,137/0/479,138/0/479,139/0/479,140/0/479,141/0/479,142/0/479,143/0/479,144/0/479,145/0/479,146/0/479,147/0/479,148/0/479,149/0/479,150/0/479,151/0/479,152/0/479,153/0/479,154/0/479,155/0/479,156/0/479,157/0/479,158/0/479,159/0/479,160/0/479,161/0/479,162/0/479,163/0/479,164/0/479,165/0/479,166/0/479,167/0/479,168/0/479,169/0/479,170/0/479,171/0/479,172/0/479,173/0/479,174/0/479,175/0/479,176/0/479,177/0/479,178/0/479,179/0/479,180/0/479,181/0/479,182/0/479,183/0/479,184/0/479,185/0/479,186/0/479,187/0/479,188/0/479,189/0/479,190/0/479,191/0/479,192/0/479,193/0/479,194/0/479,195/0/479,196/0/479,197/0/479,198/0/479,199/0/479,200/0/479,201/0/479,202/0/479,203/0/479,204/0/479,205/0/479,206/0/479,207/0/479,208/0/479,209/0/479,210/0/479,211/0/479,212/0/479,213/0/479,214/0/479,215/0/479,216/0/479,217/0/479,218/0/479,219/0/479,220/0/479,221/0/479,222/0/479,223/0/479,224/0/479,225/0/479,226/0/479,227/0/479,228/0/479,229/0/479,230/0/479,231/0/479,232/0/479,233/0/479,234/0/479,235/0/479,236/0/479,237/0/479,238/0/479,239/0/479,240/0/479,241/0/479,242/0/479,243/0/479,244/0/479,245/0/479,246/0/479,247/0/479,248/0/479,249/0/479,250/0/479,251/0/479,252/0/479,253/0/479,254/0/479,255/0/479,256/0/479,257/0/479,258/0/479,259/0/479,260/0/479,261/0/479,262/0/479,263/0/479,264/0/479,265/0/479,266/0/479,267/0/479,268/0/479,269/0/479,270/0/479,271/0/479,272/0/479,273/0/479,274/0/479,275/0/479,276/0/479,277/0/479,278/0/479,279/0/479,280/0/479,281/0/479,282/0/479,283/0/479,284/0/479,285/0/479,286/0/479,287/0/479,288/0/479,289/0/479,290/0/479,291/0/479,292/0/479,293/0/479,294/0/479,295/0/479,296/0/479,297/0/479,298/0/479,299/0/479,300/0/479,301/0/479,302/0/479,303/0/479,304/0/479,305/0/479,306/0/479,307/0/479,308/0/479,309/0/479,310/0/479,311/0/479,312/0/479,313/0/479,314/0/479,315/0/479,316/0/479,317/0/479,318/0/479,319/0/479,320/0/479,321/0/479,322/0/479,323/0/479,324/0/479,325/0/479,326/0/479,327/0/479,328/0/479,329/0/479,330/0/479,331/0/479,332/0/479,333/0/479,334/0/479,335/0/479,336/0/479,337/0/479,338/0/479,339/0/479,340/0/479,341/0/479,342/0/479,343/0/479,344/0/479,345/0/479,346/0/479,347/0/479,348/0/479,349/0/479,350/0/479,351/0/479,352/0/479,353/0/479,354/0/479,355/0/479,356/0/479,357/0/479,358/0/479,359/0/479,360/0/479,361/0/479,362/0/479,363/0/479,364/0/479,365/0/479,366/0/479,367/0/479,368/0/479,369/0/479,370/0/479,371/0/479,372/0/479,373/0/479,374/0/479,375/0/479,376/0/479,377/0/479,378/0/479,379/0/479,380/0/479,381/0/479,382/0/479,383/0/479,384/0/479,385/0/479,386/0/479,387/0/479,388/0/479,389/0/479,390/0/479,391/0/479,392/0/479,393/0/479,394/0/479,395/0/479,396/0/479,397/0/479,398/0/479,399/0/479,400/0/479,401/0/479,402/0/479,403/0/479,404/0/479,405/0/479,406/0/479,407/0/479,408/0/479,409/0/479,410/0/479,411/0/479,412/0/479,413/0/479,414/0/479,415/0/479,416/0/479,417/0/479,418/0/479,419/0/479,420/0/479,421/0/479,422/0/479,423/0/479,424/0/479,425/0/479,426/0/479,427/0/479,428/0/479,429/0/479,430/0/479,431/0/479,432/0/479,433/0/479,434/0/479,435/0/479,436/0/479,437/0/479,438/0/479,439/0/479,440/0/479,441/0/479,442/0/479,443/0/479,444/0/479,445/0/479,446/0/479,447/0/479,448/0/479,449/0/479,450/0/479,451/0/479,452/0/479,453/0/479,454/0/479,455/0/479,456/0/479,457/0/479,458/0/479,459/0/479,460/0/479,461/0/479,462/0/479,463/0/479,464/0/479,465/0/479,466/0/479,467/0/479,468/0/479,469/0/479,470/0/479,471/0/479,472/0/479,473/0/479,474/0/479,475/0/479,476/0/479,477/0/479,478/0/479,479/0/479,480/0/479,
GFXMMU.IPParameters=Buf0Address,Buf1Address,GFXMMUtable
GPIO.groupedBy=Group By Peripherals
I2C1.IPParameters=Timing
I2C1.Timing=0x20B0CCFF
I2C3.IPParameters=Timing
I2C3.Timing=0x20B0CCFF
I2C4.IPParameters=Timing
RCC.LPTIM1Freq_Value=140000000
RCC.SAI2BFreq_Value=93333333.33333333
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
PD15.GPIOParameters=GPIO_Label
PA4.Mode=RGB565
I2C4.Timing=0x20B0CCFF
SPI1.Direction=SPI_DIRECTION_1LINE
RCC.I2C4Freq_Value=140000000
PE2.Mode=OCTOSPI1_IOL_Port1L
TIM2.IPParameters=Channel-PWM Generation1 CH1
PD4.Signal=GPXTI4
PB6.Signal=I2C1_SCL
PC7.Signal=LTDC_G6
PB12.PinState=GPIO_PIN_SET
PB6.Mode=I2C
RCC.DIVQ3Freq_Value=64000000
SPI1.CalculateBaudRate=15.625 KBits/s
PD0.Signal=FDCAN1_RX
PD8.Signal=GPIO_Input
PE5.Signal=GPIO_Input
PE1.Signal=LTDC_R6
PE14.Locked=true
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA0.Locked=true
NVIC.TIM8_TRG_COM_TIM14_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PB3.Mode=Asynchronous
PB2.Signal=OCTOSPIM_P1_CLK
PA8.Locked=true
PA4.Locked=true
RCC.DIVM3=2
VP_OCTOSPI1_VS_quad.Mode=quad_mode
RCC.DIVM2=2
PD1.GPIOParameters=GPIO_Label
RCC.DIVM1=2
RCC.RTCClockSelection=RCC_RTCCLKSOURCE_LSE
PD1.GPIO_Label=BZR
RCC.DFSDM2Freq_Value=140000000
PB12.GPIO_Label=LCD_nRESET
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.9.0
MxDb.Version=DB.6.0.20
PB0.GPIOParameters=GPIO_Label
LTDC.IPParameters=PixelFormat_L0,Layers,Alpha0_L0,Alpha_L0,WindowX1_L0,WindowY1_L0,HSync,HBP,ActiveW,HFP,VSync,VBP,VFP
LTDC.PixelFormat_L0=LTDC_PIXEL_FORMAT_RGB565
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=280000000
PC4.GPIO_Label=LCD_R7
TIM1.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
PE9.Signal=S_TIM1_CH1
RCC.DFSDM2ACLkFreq_Value=140000000
PE9.Locked=true
RCC.USART16Freq_Value=140000000
PE4.GPIO_Label=REV_ID_0
PC9.Mode=I2C
PH1-OSC_OUT.Locked=true
PE2.Signal=OCTOSPIM_P1_IO2
PA8.Signal=I2C3_SCL
SPI1.VirtualNSS=VM_NSSHARD
PE1.Locked=true
PB6.Locked=true
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
PD3.Mode=RGB565
RCC.DIVR2Freq_Value=128000000
LTDC.HSync=25
ProjectManager.HalAssertFull=false
SH.ADCx_INP3.1=ADC1_INP3,IN3-Single-Ended
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
RCC.DIVP2Freq_Value=128000000
SH.ADCx_INP3.0=ADC2_INP3
PA0.Signal=S_TIM2_CH1
PD15.Mode=Asynchronous
RCC.MCO2PinFreq_Value=280000000
PC8.GPIOParameters=GPIO_Label
PB9.Signal=FDCAN1_TX
Mcu.Package=TFBGA100
PA5.Locked=true
NVIC.TimeBase=TIM6_DAC_IRQn
RCC.PLL3FRACN=0
PD12.Signal=I2C4_SCL
PD5.GPIOParameters=GPIO_Label
PA14.Locked=true
PC3_C.GPIO_Label=QSPI_FLASH_IO0
NVIC.TimeBaseIP=TIM6
PA10.Signal=LTDC_B4
FREERTOS.FootprintOK=true
RCC.DFSDMFreq_Value=140000000
PA5.GPIOParameters=GPIO_Label
PC11.Mode=OCTOSPI1_Port1_NCS
PB14.GPIOParameters=GPIO_Label
RCC.TraceFreq_Value=280000000
LTDC.VSync=8
RCC.APB4Freq_Value=140000000
RCC.CECFreq_Value=32000
RCC.FDCANCLockSelection=RCC_FDCANCLKSOURCE_PLL2
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.tgfx_location=By Address
VP_DMA2D_VS_DMA2D.Mode=DMA2D_Activate
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
RCC.LPUART1Freq_Value=140000000
PB10.GPIOParameters=GPIO_Label
VP_TIM14_VS_ClockSourceINT.Mode=Enable_Timer
PE6.Locked=true
TIM14.IPParameters=Prescaler,Period
PD5.Locked=true
PE6.GPIO_PuPd=GPIO_PULLUP
SH.ADCx_INP7.ConfNb=1
PA4.GPIO_Label=LCD_VSYNC
PD15.Signal=UART9_TX
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
PC4.Mode=RGB565
RCC.VCO3OutputFreq_Value=128000000
PA5.Mode=Simplex_Bidirectional_Master
VP_STMicroelectronics.X-CUBE-TOUCHGFX_VS_GraphicsJjApplication_4.15.0.Mode=GraphicsJjApplication
PA6.GPIOParameters=GPIO_Label
ProjectManager.ProjectFileName=smarthaloE-stm-firmware.ioc
VP_GFXMMU_VS_GFXMMU.Mode=GFXMMU_Activate
RCC.DIVQ2=16
RCC.DIVQ1=6
FREERTOS.Tasks01=guiTask,24,4096,StartGuiTask,Default,NULL,Dynamic,NULL,NULL
ADC1.Rank-0\#ChannelRegularConversion=1
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=79
PC11.Locked=true
Mcu.Pin73=VP_GFXMMU_VS_GFXMMU
Mcu.Pin74=VP_OCTOSPI1_VS_quad
Mcu.Pin71=VP_DMA2D_VS_DMA2D
Mcu.Pin72=VP_FREERTOS_VS_CMSIS_V2
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,OffsetSignedSaturation-0\#ChannelRegularConversion,NbrOfConversionFlag,master
Mcu.Pin77=VP_TIM14_VS_ClockSourceINT
Mcu.Pin78=VP_STMicroelectronics.X-CUBE-TOUCHGFX_VS_GraphicsJjApplication_4.15.0
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
Mcu.Pin75=VP_RTC_VS_RTC_Activate
PA9.GPIO_Label=CHARGE_nTE
Mcu.Pin76=VP_SYS_VS_tim6
RCC.SWPMI1Freq_Value=140000000
PD3.Signal=LTDC_G7
PE1.Mode=RGB565
RCC.DIVP3=128
Mcu.Pin70=VP_CRC_VS_CRC
PC6.Signal=LTDC_HSYNC
PB11.GPIO_Label=CHARGE_CE
PD7.Signal=SPI1_MOSI
PD13.GPIOParameters=GPIO_Label
PD1.Signal=GPIO_Output
PA11.GPIO_Label=LCD_R4
RCC.DIVP2=1
Mcu.Pin68=PD8
Mcu.Pin69=PD12
PC0.Signal=LTDC_G2
PB14.Locked=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
PC11.GPIOParameters=GPIO_Label
RCC.QSPIFreq_Value=93333333.33333333
Mcu.Pin62=PD13
Mcu.Pin63=PA3
Mcu.Pin60=PE8
Mcu.Pin61=PB10
Mcu.Pin66=PB11
Mcu.Pin67=PB12
Mcu.Pin64=PA7
Mcu.Pin65=PE9
PE8.Mode=Asynchronous
PD10.Signal=LTDC_B3
PB8.GPIO_Label=LCD_B6
RCC.USART234578Freq_Value=140000000
PA15.Locked=true
PA11.Locked=true
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.IPParameters=tgfx_display_interface,tgfx_buffering_strategy,tgfx_location,tgfx_address1,tgfx_address2,tgfx_vsync,tgfx_hardware_accelerator,ApplicationCcGraphicsJjApplication
RCC.Tim1OutputFreq_Value=280000000
PA8.GPIO_Label=I2C_ACCEL_SCL
PC15-OSC32_OUT.Locked=true
Mcu.Pin59=PB0
RCC.CDPPRE1=RCC_APB1_DIV2
SH.GPXTI2.ConfNb=1
Mcu.Pin57=PA2
RCC.CDPPRE2=RCC_APB2_DIV2
RCC.SPI123Freq_Value=1000000
Mcu.Pin58=PA6
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.ApplicationCcGraphicsJjApplication=TouchGFXOoGenerator
Mcu.Pin51=PC5
Mcu.Pin52=PE7
PC3_C.GPIOParameters=GPIO_Label
Mcu.Pin50=PA5
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
PC6.Mode=RGB565
Mcu.Pin55=PD10
Mcu.Pin56=PB14
Mcu.Pin53=PE11
Mcu.Pin54=PD14
PE8.GPIO_Label=UART_BLE_TX
PC6.Locked=true
PA9.Signal=GPIO_Output
RCC.DIVN3=8
RCC.DIVN2=8
I2C1.Timing=0x20B0CCFF
RCC.DIVN1=35
PB9.Locked=true
PB5.Locked=true
PB11.GPIOParameters=GPIO_Label
PD7.Locked=true
PE9.GPIO_Label=PWM_BL
Mcu.Pin48=PB15
Mcu.Pin49=PA1
Mcu.Pin46=PE14
ADC1.OffsetSignedSaturation-0\#ChannelRegularConversion=DISABLE
Mcu.Pin47=PD15
PB10.Signal=LTDC_G4
PB14.Signal=GPIO_Output
Mcu.Pin40=PC8
PA5.Signal=SPI1_SCK
Mcu.Pin41=PC6
Mcu.Pin44=PC4
Mcu.Pin45=PB2
Mcu.Pin42=PA0
Mcu.Pin43=PA4
PE1.GPIO_Label=LCD_R6
ProjectManager.LastFirmware=true
PC2_C.GPIO_Label=LDO_BZR_EN
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.tgfx_vsync=vsync_ltdc
VP_SYS_VS_tim6.Signal=SYS_VS_tim6
RCC.AHB12Freq_Value=280000000
PE14.Signal=LTDC_CLK
PA1.Mode=OCTOSPI1_IOL_Port1L
VP_DMA2D_VS_DMA2D.Signal=DMA2D_VS_DMA2D
PB4.GPIO_Label=PGOOD_VIN
Mcu.Pin37=PC0
Mcu.Pin38=PC1
Mcu.Pin35=PC9
PB15.GPIO_Label=LDO_NRF_EN
Mcu.Pin36=PC7
PE8.Signal=UART7_TX
SPI1.Mode=SPI_MODE_MASTER
Mcu.Pin39=PC3_C
RCC.RNGFreq_Value=48000000
Mcu.Pin30=PA8
PA1.GPIO_Label=QSPI_FLASH_IO3
Mcu.Pin33=PE6
Mcu.Pin34=PD1
Mcu.Pin31=PA10
Mcu.Pin32=PC2_C
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PC10.GPIOParameters=GPIO_Label
RCC.CDPPRE=RCC_APB3_DIV2
PE7.Locked=true
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
PC9.GPIOParameters=GPIO_Label
RCC.LPTIM2Freq_Value=140000000
Mcu.Pin26=PE5
Mcu.Pin27=PD7
TIM14.Prescaler=4666
Mcu.Pin24=PA11
ProjectManager.UnderRoot=true
PE4.GPIO_PuPd=GPIO_PULLUP
Mcu.Pin25=PH1-OSC_OUT
SH.ADCx_INP7.0=ADC1_INP7,IN7-Single-Ended
PC7.GPIO_Label=LCD_G6
Mcu.Pin28=PD4
Mcu.Pin29=PD0
PB4.Locked=true
FDCAN1.DataPrescaler=32
PA4.Signal=LTDC_VSYNC
PD14.GPIOParameters=GPIO_Label
PB5.Signal=LTDC_B5
Mcu.Pin22=PC12
Mcu.Pin23=PA9
Mcu.Pin20=PB5
ADC1.master=1
Mcu.Pin21=PD3
PA3.Locked=true
PD12.Mode=I2C
PD10.Locked=true
PA10.Locked=true
PA5.GPIO_Label=SPI_LCD_SCK
NVIC.ForceEnableDMAVector=true
PA14.GPIOParameters=GPIO_Label
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PE5.GPIO_Label=REV_ID_1
PC12.GPIO_Label=TP_RESET
ProjectManager.CompilerOptimize=6
PD15.Locked=true
LTDC.Alpha_L0=255
PA11.Signal=LTDC_R4
ProjectManager.HeapSize=0x200
Mcu.Pin15=PC10
PA0.GPIOParameters=GPIO_Label
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PA12
Mcu.Pin13=PD2
VP_STMicroelectronics.X-CUBE-TOUCHGFX_VS_GraphicsJjApplication_4.15.0.Signal=STMicroelectronics.X-CUBE-TOUCHGFX_VS_GraphicsJjApplication_4.15.0
Mcu.Pin14=PC11
Mcu.Pin19=PE1
RCC.LPTIM345Freq_Value=140000000
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PH0-OSC_IN
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.GraphicsJjApplication_Checked=true
Mcu.Pin18=PE4
RCC.LTDCFreq_Value=128000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PB6
Mcu.Pin12=PD5
PD0.GPIOParameters=GPIO_Label
PB8.Mode=RGB565
Mcu.Pin10=PB8
PE2.Locked=true
PA8.Mode=I2C
PD2.Signal=LTDC_B7
RCC.HCLK3ClockFreq_Value=280000000
RCC.DIVR3=1
RCC.DIVR2=1
PD1.Locked=true
PB0.Signal=LTDC_R3
RCC.SAI2AFreq_Value=93333333.33333333
PA7.GPIOParameters=GPIO_Label
PC0.Locked=true
PC1.Signal=LTDC_G5
PB12.GPIOParameters=PinState,GPIO_Label
PD2.GPIO_Label=LCD_B7
PD7.GPIOParameters=GPIO_Label
LTDC.Alpha0_L0=0
PC1.Mode=RGB565
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=8000000
ProjectManager.MainLocation=Core/Src
PE7.GPIO_PuPd=GPIO_PULLUP
RCC.CDCPREFreq_Value=280000000
RCC.SAI1Freq_Value=93333333.33333333
RCC.CortexFreq_Value=280000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H7A3VIHx
LTDC.HBP=30
PE11.GPIO_Label=LCD_G3
PC10.Locked=true
PC10.Signal=OCTOSPIM_P1_IO1
PC5.Locked=true
PA12.GPIOParameters=GPIO_Label
PA0.GPIO_Label=PWM_PIEZO_VOLUME
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC1_Init-ADC1-false-HAL-true,4-MX_CRC_Init-CRC-false-HAL-true,5-MX_FDCAN1_Init-FDCAN1-false-HAL-true,6-MX_GFXMMU_Init-GFXMMU-false-HAL-true,7-MX_I2C1_Init-I2C1-false-HAL-true,8-MX_I2C4_Init-I2C4-false-HAL-true,9-MX_LTDC_Init-LTDC-false-HAL-true,10-MX_OCTOSPI1_Init-OCTOSPI1-false-HAL-true,11-MX_RTC_Init-RTC-false-HAL-true,12-MX_SPI1_Init-SPI1-false-HAL-true,13-MX_UART7_Init-UART7-false-HAL-true,14-MX_UART9_Init-UART9-false-HAL-true,15-MX_I2C3_Init-I2C3-false-HAL-true,16-MX_TIM1_Init-TIM1-false-HAL-true,17-MX_TIM2_Init-TIM2-false-HAL-true,18-MX_DMA2D_Init-DMA2D-false-HAL-true,19-MX_TIM14_Init-TIM14-false-HAL-true,21-MX_TouchGFX_Init-STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0-false-HAL-false,22-MX_TouchGFX_Process-STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0-false-HAL-false,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PA9.GPIOParameters=GPIO_Label
PC0.GPIOParameters=GPIO_Label
PA11.GPIOParameters=GPIO_Label
PC0.GPIO_Label=LCD_G2
PD0.GPIO_Label=CAN_RX
PA11.Mode=RGB565
PC9.Locked=true
PB0.GPIO_Label=LCD_R3
RCC.PLL2FRACN=0
PD2.Locked=true
RCC.VCO2OutputFreq_Value=128000000
PC1.Locked=true
PB11.Signal=GPIO_Output
PB15.Signal=GPIO_Output
PE5.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_Label
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
SH.GPXTI2.0=GPIO_EXTI2
RCC.VCOInput3Freq_Value=16000000
PD13.Signal=I2C4_SDA
Mcu.IP4=DMA2D
Mcu.IP5=FDCAN1
PD13.Locked=true
Mcu.IP2=CRC
I2C1.IPParameters=Timing
Mcu.IP3=DEBUG
PB4.GPIOParameters=GPIO_Label
PA15.GPIO_Label=SPI_LCD_nCS
Mcu.IP0=ADC1
PA12.Locked=true
Mcu.IP1=CORTEX_M7
PA12.Signal=LTDC_R5
PE4.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.UserConstants=
PE11.Mode=RGB565
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.tgfx_buffering_strategy=Double
PE5.GPIO_PuPd=GPIO_PULLUP
PC1.GPIOParameters=GPIO_Label
RCC.DIVP3Freq_Value=1000000
RCC.SDMMCFreq_Value=93333333.33333333
Mcu.ThirdPartyNb=1
RCC.HCLKFreq_Value=280000000
Mcu.IPNb=23
ProjectManager.PreviousToolchain=STM32CubeIDE
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0_SwParameter=ApplicationCcGraphicsJjApplication\:TouchGFXOoGenerator;
RCC.SPDIFRXFreq_Value=93333333.33333333
LTDC.WindowX1_L0=480
PD8.GPIOParameters=GPIO_Label
