SrPatinhas/smarthalo-firmware/smart_halo-smarthaloe-stm-firmware-2d2a7e89e745/smarthaloE-stm-firmware.ioc
PA8.GPIOParameters=GPIO_Label
PD10.Mode=RGB565
Mcu.Pin6=PA15
Mcu.Pin7=PA14
Mcu.Pin8=PA13
Mcu.Pin9=PC15-OSC32_OUT
FREERTOS.IPParameters=Tasks01,configTOTAL_HEAP_SIZE,configUSE_IDLE_HOOK,FootprintOK
PC2_C.Signal=GPIO_Output
PH0-OSC_IN.Mode=HSE-External-Oscillator
Mcu.Pin0=PC14-OSC32_IN
Mcu.Pin1=PE2
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PB9
Mcu.Pin3=PB7
Mcu.Pin4=PB4
PD10.GPIOParameters=GPIO_Label
Mcu.Pin5=PB3
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_3
I2C3.IPParameters=Timing
RCC.DIVR3Freq_Value=128000000
RCC.HSE_VALUE=32000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.IP10=I2C4
TIM14.Period=290
PA15.Mode=NSS_Signal_Hard_Output
Mcu.IP12=NVIC
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true
Mcu.IP11=LTDC
Mcu.IP18=TIM1
LTDC.VBP=20
Mcu.IP17=SYS
VP_GFXMMU_VS_GFXMMU.Signal=GFXMMU_VS_GFXMMU
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0
Mcu.IP19=TIM2
Mcu.IP14=RCC
RCC.DIVP1Freq_Value=280000000
Mcu.IP13=OCTOSPI1
RCC.PLL1_VCI_Range-AdvancedSettings=RCC_PLL1VCIRANGE_0
Mcu.IP16=SPI1
Mcu.IP15=RTC
PC14-OSC32_IN.Mode=LSE-External-Oscillator
PA14.Mode=Serial_Wire
PE8.Locked=true
PD14.Mode=Asynchronous
PB5.Mode=RGB565
PC11.GPIO_Label=QSPI_FLASH_nCS
File.Version=6
PA10.GPIO_Label=LCD_B4
PB3.GPIOParameters=GPIO_Label
LTDC.HFP=4
PB7.Signal=I2C1_SDA
SH.S_TIM2_CH1.ConfNb=1
Mcu.IP21=UART7
PB8.Locked=true
Mcu.IP20=TIM14
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Mcu.IP22=UART9
DMA2D.ColorMode=DMA2D_OUTPUT_RGB565
LTDC.ActiveW=480
PE4.Signal=GPIO_Input
PE6.GPIOParameters=GPIO_PuPd,GPIO_Label
PB6.GPIOParameters=GPIO_Label
PB0.Locked=true
FREERTOS.configTOTAL_HEAP_SIZE=30000
PC2_C.Locked=true
ProjectManager.ProjectName=smarthaloE-stm-firmware
PD7.GPIO_Label=SPI_LCD_MOSI
RCC.APB3Freq_Value=140000000
PA13.GPIOParameters=GPIO_Label
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PB7.GPIO_Label=I2C_LIGHT_SDA
PD13.GPIO_Label=I2C_TP_SDA
PA6.Signal=ADCx_INP3
PA7.Locked=true
DMA2D.OutputOffset=1056
GFXMMU.Buf0Address=0x30000000
PD5.GPIO_Label=TP_INT
ProjectManager.ToolChainLocation=
PD14.Locked=true
PA2.GPIO_Label=ACCEL_INT1
SH.GPXTI5.ConfNb=1
PA15.Signal=SPI1_NSS
DMA2D.IPParameters=ColorMode,OutputOffset
RCC.DIVR1Freq_Value=280000000
I2C3.Timing=0x20B0CCFF
PB5.GPIO_Label=LCD_B5
PC4.Locked=true
PD3.GPIO_Label=LCD_G7
PC5.Signal=LTDC_DE
PE7.Signal=GPIO_Input
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_64
VP_OCTOSPI1_VS_quad.Signal=OCTOSPI1_VS_quad
PE2.GPIO_Label=QSPI_FLASH_IO2
RCC.SRDPPRE=RCC_APB4_DIV2
PC14-OSC32_IN.Locked=true
RCC.Tim2OutputFreq_Value=280000000
RCC.DFSDMACLkFreq_Value=93333333.33333333
PB3.Locked=true
PB4.Signal=GPIO_Input
PB15.Locked=true
PA3.Signal=GPIO_Input
PB3.GPIO_Label=UART_BLE_RX
PA2.Locked=true
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
SH.GPXTI5.0=GPIO_EXTI5
PE8.GPIOParameters=GPIO_Label
SH.S_TIM2_CH1.0=TIM2_CH1,PWM Generation1 CH1
LTDC.VFP=15
PB8.GPIOParameters=GPIO_Label
PD15.GPIO_Label=UART_DBG_TX
LTDC.WindowY1_L0=480
PB9.GPIO_Label=CAN_TX
PE14.GPIOParameters=GPIO_Label
PC10.GPIO_Label=QSPI_FLASH_IO1
PA10.Mode=RGB565
VP_TIM14_VS_ClockSourceINT.Signal=TIM14_VS_ClockSourceINT
PC9.GPIO_Label=I2C_ACCEL_SDA
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,VirtualNSS
NVIC.SavedSvcallIrqHandlerGenerated=true
PC11.Signal=OCTOSPIM_P1_NCS
PC8.Signal=GPIO_Output
PC10.Mode=OCTOSPI1_IOL_Port1L
PC4.Signal=LTDC_R7
ProjectManager.DefaultFWLocation=true
PE14.GPIO_Label=LCD_PCLK
PD5.Signal=GPXTI5
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
FDCAN1.IPParameters=DataPrescaler
PA12.GPIO_Label=LCD_R5
PinOutPanel.CurrentBGAView=Top
RCC.FamilyName=M
PC0.Mode=RGB565
PB9.GPIOParameters=GPIO_Label
PE9.GPIOParameters=GPIO_Label
PD8.GPIO_Label=CHARGE_STAT2
PD12.Locked=true
RCC.SPI6Freq_Value=140000000
PC8.GPIO_Label=LDO_LCD_EN
PC12.GPIOParameters=GPIO_Label
PA13.Signal=DEBUG_JTMS-SWDIO
FREERTOS.configUSE_IDLE_HOOK=1
RCC.SPI45Freq_Value=140000000
SH.S_TIM1_CH1.0=TIM1_CH1,PWM Generation1 CH1
PD12.GPIOParameters=GPIO_Label
ProjectManager.TargetToolchain=STM32CubeIDE
PB10.GPIO_Label=LCD_G4
PE7.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.VCO1OutputFreq_Value=560000000
PC3_C.Locked=true
PB7.GPIOParameters=GPIO_Label
PB9.Mode=FDCAN_Activate
PC5.GPIOParameters=GPIO_Label
PB2.GPIOParameters=GPIO_Label
RCC.AXIClockFreq_Value=280000000
PD13.Mode=I2C
PE4.Locked=true
PE2.GPIOParameters=GPIO_Label
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=93333333.33333333
PD10.GPIO_Label=LCD_B3
PE11.Signal=LTDC_G3
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PD3.Locked=true
PA1.Signal=OCTOSPIM_P1_IO3
RCC.CKPERFreq_Value=64000000
PD2.Mode=RGB565
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.tgfx_hardware_accelerator=dma_2d
PB0.Mode=RGB565
board=custom
GFXMMU.IPParameters=Buf0Address,Buf1Address
RCC.VCOInput1Freq_Value=16000000
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=140000000
MxCube.Version=6.2.0
LTDC.Layers=0
PD4.GPIO_Label=ACCEL_INT2
RCC.FDCANFreq_Value=8000000
PE14.Mode=RGB565
RCC.ADCFreq_Value=128000000
PC1.GPIO_Label=LCD_G5
PA10.GPIOParameters=GPIO_Label
PD4.GPIOParameters=GPIO_Label
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PD14.GPIO_Label=UART_DBG_RX
PA4.GPIOParameters=GPIO_Label
PE5.Locked=true
PE6.Signal=GPIO_Input
PB15.GPIOParameters=GPIO_Label
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CDCPREFreq_Value,CDPPRE,CDPPRE1,CDPPRE2,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,DFSDM2ACLkFreq_Value,DFSDM2Freq_Value,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1Freq_Value,DIVP2,DIVP2Freq_Value,DIVP3,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2,DIVR2Freq_Value,DIVR3,DIVR3Freq_Value,FDCANCLockSelection,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL1_VCI_Range-AdvancedSettings,PLL2FRACN,PLL3FRACN,PLLFRACN,PLLSourceVirtual,QSPICLockSelection,QSPIFreq_Value,RNGFreq_Value,RTCClockSelection,RTCFreq_Value,SAI1Freq_Value,SAI2AFreq_Value,SAI2BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123CLockSelection,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SRDPPRE,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
PE11.Locked=true
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H7A3V(G-I)Hx
PD0.Mode=FDCAN_Activate
PE7.GPIO_Label=REV_ID_3
NVIC.SavedPendsvIrqHandlerGenerated=true
PA13.GPIO_Label=MCU_SWDIO
PA2.Signal=GPXTI2
PB2.Locked=true
Mcu.IP8=I2C1
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Mcu.IP9=I2C3
PD14.Signal=UART9_RX
Mcu.IP6=FREERTOS
Mcu.IP7=GFXMMU
ProjectManager.CoupleFile=false
PB3.Signal=UART7_RX
RCC.SYSCLKFreq_VALUE=280000000
RCC.I2C123Freq_Value=140000000
PA1.Locked=true
PA7.GPIO_Label=VIN_AN
SH.GPXTI4.0=GPIO_EXTI4
PA12.Mode=RGB565
KeepUserPlacement=false
PC5.GPIO_Label=LCD_DE
PA13.Locked=true
PB2.Mode=O1_P1_CLK
RCC.QSPICLockSelection=RCC_OSPICLKSOURCE_PLL
PB7.Mode=I2C
PA14.Signal=DEBUG_JTCK-SWCLK
PB2.GPIO_Label=QSPI_FLASH_CLK
SH.GPXTI4.ConfNb=1
PC6.GPIOParameters=GPIO_Label
ADC1.NbrOfConversionFlag=1
PC3_C.Signal=OCTOSPIM_P1_IO0
PB7.Locked=true
RCC.DIVQ1Freq_Value=93333333.33333333
PB8.Signal=LTDC_B6
PC2_C.GPIOParameters=GPIO_Label
PC8.Locked=true
PC9.Signal=I2C3_SDA
SH.ADCx_INP3.ConfNb=2
PC7.Mode=RGB565
RCC.VCOInput2Freq_Value=16000000
RCC.APB1Freq_Value=140000000
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.tgfx_address2=0x30708000
STMicroelectronics.X-CUBE-TOUCHGFX.4.15.0.tgfx_address1=0x30000000
VP_CRC_VS_CRC.Mode=CRC_Activate
PB11.Locked=true
ProjectManager.DeviceId=STM32H7A3VIHx
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
I2C4.IPParameters=Timing
PE1.GPIOParameters=GPIO_Label
PA3.GPIO_Label=CHARGE_STAT1
PA7.Signal=ADCx_INP7
PA6.Locked=true
